Revit 2026 API

# RevitAPISingleEventArgs Properties

---

The RevitAPISingleEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

RevitAPISingleEventArgs Class

Autodesk.Revit.DB.Events Namespace